uhnp/src/InformationRegisters/УдалитьОбъектыСвязанныхФайлов/УдалитьОбъектыСвязанныхФайлов.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>УдалитьОбъектыСвязанныхФайлов</name>
  <attributes>
    <name>ПризнакПереноса</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <dimensions>
    <name>ИмпортированныйОбъект</name>
    <type>
      <types>AnyRef</types>
    </type>
  </dimensions>
  <dimensions>
    <name>СвязанныйФайл</name>
    <type>
      <types>CatalogRef.Файлы</types>
    </type>
  </dimensions>
</mdclass:InformationRegister>

uhnp/src/InformationRegisters/УдалитьОбъектыСвязанныхФайлов/Forms/ФормаСпискаТекущегоОбъека/Module.bsl
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	Список.Параметры.Элементы[0].Значение=Параметры.Отбор.ИмпортированныйОбъект;
	Список.Параметры.Элементы[0].Использование=Истина;
	
	ПапкаПоУмолчанию=Справочники.ПапкиФайлов.НайтиПоНаименованию("НЕ УДАЛЯТЬ Данные вложенных файлов");
	Если ПапкаПоУмолчанию=Справочники.ПапкиФайлов.ПустаяСсылка() Тогда
	КонецЕсли;
	
	ТекущийЭлементССылка=Параметры.Отбор.ИмпортированныйОбъект; 	
	
КонецПроцедуры

&НаКлиенте
Процедура СоздатьФайлСДиска(Команда)
	
	//ЗначениеПараметраКД = Список.Параметры.НайтиЗначениеПараметра(Новый ПараметрКомпоновкиДанных("Владелец"));
	//Если ЗначениеПараметраКД = Неопределено Тогда
		ВладелецФайла = ПапкаПоУмолчанию;
	//Иначе
	//	ВладелецФайла = ЗначениеПараметраКД.Значение;
	//КонецЕсли;
	
	ПараметрыДобавления = Новый Структура;
	ПараметрыДобавления.Вставить("ОбработчикРезультата", Неопределено);
	ПараметрыДобавления.Вставить("ВладелецФайла", ВладелецФайла);
	ПараметрыДобавления.Вставить("ФормаВладелец", ЭтотОбъект);
	ПараметрыДобавления.Вставить("НеОткрыватьКарточкуПослеСозданияИзФайла", Неопределено);
	
	Результат=РаботаСФайламиСлужебныйКлиент.ДобавитьИзФайловойСистемыСРасширениемСинхронно(ПараметрыДобавления);
	Если Результат.ФайлДобавлен Тогда
		 ДобавитьТекЗапись(Результат.ФайлСсылка);	
	КонецЕсли;

КонецПроцедуры

&НаКлиенте
Процедура Просмотреть(Команда)
	ДанныеФайла = РаботаСФайламиСлужебныйВызовСервера.ДанныеФайлаДляОткрытия(Элементы.Список.ТекущиеДанные.Файл, УникальныйИдентификатор);
	РаботаСФайламиКлиент.ОткрытьФайл(ДанныеФайла);

КонецПроцедуры

&НаКлиенте
Процедура ОткрытьВерсииФайла(Команда)
	// Вставить содержимое обработчика.
КонецПроцедуры

&НаКлиенте
Процедура СоздатьФайлИзШаблона(Команда)
	
	ВладелецФайла = ПапкаПоУмолчанию;
		
	ПараметрыДобавления = Новый Структура;
	ПараметрыДобавления.Вставить("ОбработчикРезультата", Неопределено);
	ПараметрыДобавления.Вставить("ВладелецФайла", ВладелецФайла);
	ПараметрыДобавления.Вставить("ФормаВладелец", ЭтотОбъект);
	ПараметрыДобавления.Вставить("НеОткрыватьКарточкуПослеСозданияИзФайла", Неопределено);
	РаботаСФайламиСлужебныйКлиент.ДобавитьНаОсновеШаблона(ПараметрыДобавления);
	
КонецПроцедуры

&НаСервере
Процедура ДобавитьТекЗапись(ФайлСсылка)
	  НовНабор		= РегистрыСведений.УдалитьОбъектыСвязанныхФайлов.СоздатьНаборЗаписей();
	  НовНабор.Отбор.ИмпортированныйОбъект.Установить(ТекущийЭлементСсылка);
	  НовНабор.Отбор.СвязанныйФайл.Установить(ФайлСсылка);
	  НовЗапись		= НовНабор.Добавить();
	  НовЗапись.ИмпортированныйОбъект 	= ТекущийЭлементССылка;
	  НовЗапись.СвязанныйФайл			= ФайлСсылка;
	  НовНабор.Записать(Истина);
	  Элементы.Список.Обновить();
	
КонецПроцедуры
